"CIAdditionCompositing" = "加法";
"CIAffineClamp" = "仿射箝位";
"CIAffineTile" = "仿射拼贴";
"CIAffineTransform" = "仿射变换";
"CIBarsSwipeTransition"="栏挥击过渡";
"CIBlendWithMask" = "使用蒙板来混合";
"CIBloom" = "泛光";
"CIBoxBlur"="方框模糊";
"CIBumpDistortion" = "凹凸扭曲";
"CIBumpDistortionLinear"="凹凸扭曲线性";
"CICMYKHalftone" = "CMYK 半色调";
"CICheckerboardGenerator" = "棋盘";
"CICircleSplashDistortion" = "环形飞溅扭曲";
"CICircularScreen" = "圆形屏幕";
"CICircularWrap" = "圆形折回扭曲";
"CIColorControls" = "颜色控制";
"CIColorCube" = "彩色立体";
"CIColorInvert" = "颜色反转";
"CIColorMap" = "颜色映射";
"CIColorMatrix" = "色彩矩阵";
"CIColorMonochrome" = "彩色单色化";
"CIColorPosterize" = "色调分离";
"CIComicEffect" = "连环画效果";
"CIConstantColorGenerator" = "固定颜色";
"CICopyMachineTransition" = "复印机";
"CICrop" = "裁剪";
"CICrystallize" = "结晶化";
"CIDiscBlur"="光盘模糊";
"CIDisintegrateWithMaskTransition" = "使用蒙板来分解";
"CIDisplacementDistortion" = "置换扭曲";
"CIDissolveTransition" = "溶解";
"CIDotScreen" = "点屏幕";
"CIEdges" = "边沿";
"CIEdgeWork" = "边沿效果";
"CIEightfoldReflectedTile"="八倍反射拼贴";
"CIExposureAdjust" = "曝光调整";
"CIFalseColor" = "假彩色";
"CIFastBoxBlur" = "快速方框模糊";
"CIFastDiscBlur" = "快速光盘模糊";
"CIFlashTransition" = "闪光灯";
"CIFourfoldReflectedTile"="四倍反射拼贴";
"CIFourfoldRotatedTile"="四倍旋转拼贴";
"CIFourfoldTranslatedTile"="四倍转化拼贴";
"CIGammaAdjust" = "灰度系数调整";
"CIGaussianBlur" = "高斯模糊";
"CIGaussianGradient" = "高斯渐变";
"CIGlassDistortion" = "玻璃扭曲";
"CIGlassLozenge" = "玻璃菱形";
"CIGlideReflectedTile"="滑行反射拼贴";
"CIGloom" = "阴暗";
"CIHatchedScreen" = "影线屏幕";
"CIHeightFieldFromMask" = "蒙板高度场";
"CIHexagonalPixellate"="六边形像素化";
"CIHoleDistortion" = "孔洞扭曲";
"CIHueAdjust" = "色相调整";
"CIKaleidoscope" = "万花筒";
"CILanczosScaleTransform" = "Lanczos 缩放比例变换";
"CILenticularHaloGenerator" = "镜头光晕";
"CILineOverlay" = "线覆盖图";
"CILineScreen" = "直线屏幕";
"CILinearGradient" = "线性渐变";
"CIMaskToAlpha" = "蒙板至 Alpha";
"CIMaximumCompositing" = "最大";
"CIMedianFilter" = "中等";
"CIMinimumCompositing" = "最小";
"CIModTransition" = "适度";
"CIMotionBlur" = "运动模糊";
"CIMultiplyCompositing" = "乘法";
"CINoiseReduction" = "杂点消除";
"CIOpTile" = "视觉拼贴";
"CIPageCurlTransition" = "卷页";
"CIParallelogramTile" = "平行四边形拼贴";
"CIPerspectiveTile" = "透视拼贴";
"CIPerspectiveTransform" = "透视变换";
"CIPinchDistortion" = "挤压扭曲";
"CIPixellate" = "像素化";
"CIPointillize" = "点状化";
"CIRadialGradient" = "放射状渐变";
"CIRandomGenerator" = "随机生成器";
"CIRippleTransition" = "波纹";
"CISepiaTone" = "棕褐色调";
"CIShadedMaterial" = "阴影材质";
"CISharpenLuminance" = "加强亮度";
"CISixfoldReflectedTile"="六倍反射拼贴";
"CISixfoldRotatedTile"="六倍旋转拼贴";
"CISourceAtopCompositing" = "源在顶端";
"CISourceInCompositing" = "源在内";
"CISourceOutCompositing" = "源在外";
"CISourceOverCompositing" = "源在上方";
"CISpotColor" = "光斑颜色";
"CISpotLight" = "聚光灯光";
"CIStarShineGenerator" = "星光";
"CIStripesGenerator" = "条纹";
"CISunbeamsGenerator" = "阳光";
"CISwipeTransition" = "挥击";
"CITorusLensDistortion" = "圆环镜头扭曲";
"CITriangleTile" = "三角拼贴";
"CITwelvefoldReflectedTile"="十二倍反射拼贴";
"CITwirlDistortion" = "盘旋扭曲";
"CIUnsharpMask" = "非清晰蒙板";
"CIVortexDistortion" = "漩涡扭曲";
"CIWhitePointAdjust" = "白点调整";
"CIZoomBlur" = "缩放模糊";
"CIColorBlendMode" = "颜色混合模式";
"CIColorBurnBlendMode" = "颜色加深混合模式";
"CIColorDodgeBlendMode" = "颜色减淡混合模式";
"CIDarkenBlendMode" = "变暗混合模式";
"CIDifferenceBlendMode" = "差异混合模式";
"CIExclusionBlendMode" = "排斥混合模式";
"CIHardLightBlendMode" = "强光混合模式";
"CIHueBlendMode" = "色相混合模式";
"CILightenBlendMode" = "变亮混合模式";
"CILuminosityBlendMode" = "明度混合模式";
"CIMultiplyBlendMode" = "乘法混合模式";
"CIOverlayBlendMode" = "叠层混合模式";
"CISaturationBlendMode" = "饱和度混合模式";
"CIScreenBlendMode" = "屏幕混合模式";
"CISoftLightBlendMode" = "柔光混合模式";
"CIAreaHistogram" = "面积直方图";
"CIAreaMaximum" = "面积最大值";
"CIAreaMinimum" = "面积最小值";
"CIAreaMaximumAlpha" = "面积最大 Alpha";
"CIAreaMinimumAlpha" = "面积最小 Alpha";
"CIAreaAverage" = "面积平均值";
"CIRowAverage" = "行平均值";
"CIColumnAverage" = "列平均值";
"CIMinimumComponent" = "最小分量";
"CIMaximumComponent" = "最大分量";
